IZUMO-F303/esp32CamViewer_RUN/esp32CamViewer_wifi_led_RUN_up/src/app_httpd.cpp
    int val = atoi(value);
    ESP_LOGI(TAG, "%s = %d", variable, val);
    Serial.printf("Received command: var=%s, val=%s (int: %d)\n", variable, value, val);
    int res = 0;

    // First, handle LED commands independently of camera sensor state
    if (!strcmp(variable, "led_intensity")) {
        led_duty = val;
        ESP_LOGI(TAG, "Intensity command received. led_on: %d, led_duty: %d", led_on, led_duty);
        if (led_on) {
            ESP_LOGI(TAG, "Setting duty to %d", led_duty);
            ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, led_duty);
            ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
        }
    }
    else if (!strcmp(variable, "led")) {
        led_on = val;
        ESP_LOGI(TAG, "LED state command received. led_on: %d, led_duty: %d", led_on, led_duty);
        if (led_on) {
            ESP_LOGI(TAG, "Turning ON. Setting duty to %d", led_duty);
            ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, led_duty);
            ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
        } else {
            ESP_LOGI(TAG, "Turning OFF. Setting duty to 0");
            ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, 0);
            ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
        }
    }
    else {
        // Then, handle all other camera-related commands
        sensor_t *s = esp_camera_sensor_get();
        if (!strcmp(variable, "framesize")) {
            if (s->pixformat == PIXFORMAT_JPEG) {
                res = s->set_framesize(s, (framesize_t)val);
            }
        }
        else if (!strcmp(variable, "quality")) res = s->set_quality(s, val);
        else if (!strcmp(variable, "contrast")) res = s->set_contrast(s, val);
        else if (!strcmp(variable, "brightness")) res = s->set_brightness(s, val);
        else if (!strcmp(variable, "saturation")) res = s->set_saturation(s, val);
        else if (!strcmp(variable, "gainceiling")) res = s->set_gainceiling(s, (gainceiling_t)val);
        else if (!strcmp(variable, "colorbar")) res = s->set_colorbar(s, val);
        else if (!strcmp(variable, "awb")) res = s->set_whitebal(s, val);
        else if (!strcmp(variable, "agc")) res = s->set_gain_ctrl(s, val);
        else if (!strcmp(variable, "aec")) res = s->set_exposure_ctrl(s, val);
        else if (!strcmp(variable, "hmirror")) res = s->set_hmirror(s, val);
        else if (!strcmp(variable, "vflip")) res = s->set_vflip(s, val);
        else if (!strcmp(variable, "awb_gain")) res = s->set_awb_gain(s, val);
        else if (!strcmp(variable, "agc_gain")) res = s->set_agc_gain(s, val);
        else if (!strcmp(variable, "aec_value")) res = s->set_aec_value(s, val);
        else if (!strcmp(variable, "aec2")) res = s->set_aec2(s, val);
        else if (!strcmp(variable, "dcw")) res = s->set_dcw(s, val);
        else if (!strcmp(variable, "bpc")) res = s->set_bpc(s, val);
        else if (!strcmp(variable, "wpc")) res = s->set_wpc(s, val);
        else if (!strcmp(variable, "raw_gma")) res = s->set_raw_gma(s, val);
        else if (!strcmp(variable, "lenc")) res = s->set_lenc(s, val);
        else if (!strcmp(variable, "special_effect")) res = s->set_special_effect(s, val);
        else if (!strcmp(variable, "wb_mode")) res = s->set_wb_mode(s, val);
        else if (!strcmp(variable, "ae_level")) res = s->set_ae_level(s, val);
        else if (!strcmp(variable, "gpio12")) {
            gpio12_state = val;
            int channel = 4;
            if (val) {
                Serial.println("GPIO12 is now ON");
                pwm_states[channel].enabled = true;
            } else {
                Serial.println("GPIO12 is now OFF");
                pwm_states[channel].enabled = false;
                ledcWrite(channel, 0); // Immediately turn off
            }
            res = 0;
        }
        else if (!strcmp(variable, "gpio13")) {
            gpio13_state = val;
            int channel = 5;
            if (val) {
                Serial.println("GPIO13 is now ON");
                pwm_states[channel].enabled = true;
            } else {
                Serial.println("GPIO13 is now OFF");
                pwm_states[channel].enabled = false;
                ledcWrite(channel, 0); // Immediately turn off
            }
            res = 0;
        }
        else if (!strcmp(variable, "gpio14")) {
            gpio14_state = val;
            int channel = 6;
            if (val) {
                Serial.println("GPIO14 is now ON");
                pwm_states[channel].enabled = true;
            } else {
                Serial.println("GPIO14 is now OFF");
                pwm_states[channel].enabled = false;
                ledcWrite(channel, 0); // Immediately turn off
            }
            res = 0;
        }
        else if (!strcmp(variable, "gpio15")) {
            gpio15_state = val;
            int channel = 7;
            if (val) {
                Serial.println("GPIO15 is now ON");
                pwm_states[channel].enabled = true;
            } else {
                Serial.println("GPIO15 is now OFF");
                pwm_states[channel].enabled = false;
                ledcWrite(channel, 0); // Immediately turn off
            }
            res = 0;
        }
        else if (!strcmp(variable, "spd")) {
            spd_state = val;
            res = 0;
        }
        else if (!strcmp(variable, "trim")) {
            trim_state = val;
            res = 0;
        }
#if CONFIG_ESP_FACE_DETECT_ENABLED
        else if (!strcmp(variable, "face_detect")) {
            detection_enabled = val;
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
            if (!detection_enabled) {
                recognition_enabled = 0;
            }
#endif
        }
#endif
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
        else if (!strcmp(variable, "face_enroll")){
            is_enrolling = !is_enrolling;
            ESP_LOGI(TAG, "Enrolling: %s", (is_enrolling ? "true" : "false"));
        }
        else if (!strcmp(variable, "face_recognize")) {
            recognition_enabled = val;
            if (recognition_enabled) {
                detection_enabled = val;
            }
        }
#endif
        else {
            ESP_LOGI(TAG, "Unknown command: %s", variable);
            res = -1;
        }
    }

